/*
 * Copyright (c) 2016, NVIDIA CORPORATION.
 *
 * SPDX-License-Identifier: GPL-2.0
 *
 * Portions based on U-Boot's rtl8169.c.
 */

/*
 * This driver supports the Synopsys Designware Ethernet QOS (Quality Of
 * Service) IP block. The IP supports multiple options for bus type, clocking/
 * reset structure, and feature list.
 *
 * The driver is written such that generic core logic is kept separate from
 * configuration-specific logic. Code that interacts with configuration-
 * specific resources is split out into separate functions to avoid polluting
 * common code. If/when this driver is enhanced to support multiple
 * configurations, the core code should be adapted to call all configuration-
 * specific functions through function pointers, with the definition of those
 * function pointers being supplied by struct udevice_id eqos_ids[]'s .data
 * field.
 */

#include <prt_task.h>
#include <prt_cache_external.h>
#include "errno2.h"
#include "bitops.h"
#include "hardware.h"
#include "dwc_eth_qos.h"

/* Core registers */

#define EQOS_MAC_REGS_BASE 0x000
struct eqos_mac_regs
{
    uint32_t configuration;                   /* 0x000 */
    uint32_t unused_004[(0x070 - 0x004) / 4]; /* 0x004 */
    uint32_t q0_tx_flow_ctrl;                 /* 0x070 */
    uint32_t unused_070[(0x090 - 0x074) / 4]; /* 0x074 */
    uint32_t rx_flow_ctrl;                    /* 0x090 */
    uint32_t unused_094;                      /* 0x094 */
    uint32_t txq_prty_map0;                   /* 0x098 */
    uint32_t unused_09c;                      /* 0x09c */
    uint32_t rxq_ctrl0;                       /* 0x0a0 */
    uint32_t unused_0a4;                      /* 0x0a4 */
    uint32_t rxq_ctrl2;                       /* 0x0a8 */
    uint32_t unused_0ac[(0x0dc - 0x0ac) / 4]; /* 0x0ac */
    uint32_t us_tic_counter;                  /* 0x0dc */
    uint32_t unused_0e0[(0x11c - 0x0e0) / 4]; /* 0x0e0 */
    uint32_t hw_feature0;                     /* 0x11c */
    uint32_t hw_feature1;                     /* 0x120 */
    uint32_t hw_feature2;                     /* 0x124 */
    uint32_t unused_128[(0x200 - 0x128) / 4]; /* 0x128 */
    uint32_t mdio_address;                    /* 0x200 */
    uint32_t mdio_data;                       /* 0x204 */
    uint32_t unused_208[(0x300 - 0x208) / 4]; /* 0x208 */
    uint32_t address0_high;                   /* 0x300 */
    uint32_t address0_low;                    /* 0x304 */
};

#define EQOS_MAC_CONFIGURATION_GPSLCE BIT(23)
#define EQOS_MAC_CONFIGURATION_CST BIT(21)
#define EQOS_MAC_CONFIGURATION_ACS BIT(20)
#define EQOS_MAC_CONFIGURATION_WD BIT(19)
#define EQOS_MAC_CONFIGURATION_JD BIT(17)
#define EQOS_MAC_CONFIGURATION_JE BIT(16)
#define EQOS_MAC_CONFIGURATION_PS BIT(15)
#define EQOS_MAC_CONFIGURATION_FES BIT(14)
#define EQOS_MAC_CONFIGURATION_DM BIT(13)
#define EQOS_MAC_CONFIGURATION_LM BIT(12)
#define EQOS_MAC_CONFIGURATION_TE BIT(1)
#define EQOS_MAC_CONFIGURATION_RE BIT(0)

#define EQOS_MAC_Q0_TX_FLOW_CTRL_PT_SHIFT 16
#define EQOS_MAC_Q0_TX_FLOW_CTRL_PT_MASK 0xffff
#define EQOS_MAC_Q0_TX_FLOW_CTRL_TFE BIT(1)

#define EQOS_MAC_RX_FLOW_CTRL_RFE BIT(0)

#define EQOS_MAC_TXQ_PRTY_MAP0_PSTQ0_SHIFT 0
#define EQOS_MAC_TXQ_PRTY_MAP0_PSTQ0_MASK 0xff

#define EQOS_MAC_RXQ_CTRL0_RXQ0EN_SHIFT 0
#define EQOS_MAC_RXQ_CTRL0_RXQ0EN_MASK 3

#define EQOS_MAC_RXQ_CTRL2_PSRQ0_SHIFT 0
#define EQOS_MAC_RXQ_CTRL2_PSRQ0_MASK 0xff

#define EQOS_MAC_HW_FEATURE0_MMCSEL_SHIFT 8
#define EQOS_MAC_HW_FEATURE0_HDSEL_SHIFT 2
#define EQOS_MAC_HW_FEATURE0_GMIISEL_SHIFT 1
#define EQOS_MAC_HW_FEATURE0_MIISEL_SHIFT 0

#define EQOS_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT 6
#define EQOS_MAC_HW_FEATURE1_TXFIFOSIZE_MASK 0x1f
#define EQOS_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT 0
#define EQOS_MAC_HW_FEATURE1_RXFIFOSIZE_MASK 0x1f

#define EQOS_MAC_HW_FEATURE3_ASP_SHIFT 28
#define EQOS_MAC_HW_FEATURE3_ASP_MASK 0x3

#define EQOS_MAC_MDIO_ADDRESS_PA_SHIFT 21
#define EQOS_MAC_MDIO_ADDRESS_RDA_SHIFT 16
#define EQOS_MAC_MDIO_ADDRESS_CR_SHIFT 8
#define EQOS_MAC_MDIO_ADDRESS_SKAP BIT(4)
#define EQOS_MAC_MDIO_ADDRESS_GOC_SHIFT 2
#define EQOS_MAC_MDIO_ADDRESS_GOC_READ 3
#define EQOS_MAC_MDIO_ADDRESS_GOC_WRITE 1
#define EQOS_MAC_MDIO_ADDRESS_C45E BIT(1)
#define EQOS_MAC_MDIO_ADDRESS_GB BIT(0)

#define EQOS_MAC_MDIO_DATA_GD_MASK 0xffff

#define EQOS_MTL_REGS_BASE 0xd00
struct eqos_mtl_regs
{
    uint32_t txq0_operation_mode;             /* 0xd00 */
    uint32_t unused_d04;                      /* 0xd04 */
    uint32_t txq0_debug;                      /* 0xd08 */
    uint32_t unused_d0c[(0xd18 - 0xd0c) / 4]; /* 0xd0c */
    uint32_t txq0_quantum_weight;             /* 0xd18 */
    uint32_t unused_d1c[(0xd30 - 0xd1c) / 4]; /* 0xd1c */
    uint32_t rxq0_operation_mode;             /* 0xd30 */
    uint32_t unused_d34;                      /* 0xd34 */
    uint32_t rxq0_debug;                      /* 0xd38 */
};

#define EQOS_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT 16
#define EQOS_MTL_TXQ0_OPERATION_MODE_TQS_MASK 0x1ff
#define EQOS_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT 2
#define EQOS_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK 3
#define EQOS_MTL_TXQ0_OPERATION_MODE_TXQEN_ENABLED 2
#define EQOS_MTL_TXQ0_OPERATION_MODE_TSF BIT(1)
#define EQOS_MTL_TXQ0_OPERATION_MODE_FTQ BIT(0)

#define EQOS_MTL_TXQ0_DEBUG_TXQSTS BIT(4)
#define EQOS_MTL_TXQ0_DEBUG_TRCSTS_SHIFT 1
#define EQOS_MTL_TXQ0_DEBUG_TRCSTS_MASK 3

#define EQOS_MTL_RXQ0_OPERATION_MODE_RQS_SHIFT 20
#define EQOS_MTL_RXQ0_OPERATION_MODE_RQS_MASK 0x3ff
#define EQOS_MTL_RXQ0_OPERATION_MODE_RFD_SHIFT 14
#define EQOS_MTL_RXQ0_OPERATION_MODE_RFD_MASK 0x3f
#define EQOS_MTL_RXQ0_OPERATION_MODE_RFA_SHIFT 8
#define EQOS_MTL_RXQ0_OPERATION_MODE_RFA_MASK 0x3f
#define EQOS_MTL_RXQ0_OPERATION_MODE_EHFC BIT(7)
#define EQOS_MTL_RXQ0_OPERATION_MODE_RSF BIT(5)
#define EQOS_MTL_RXQ0_OPERATION_MODE_FEP BIT(4)
#define EQOS_MTL_RXQ0_OPERATION_MODE_FUP BIT(3)

#define EQOS_MTL_RXQ0_DEBUG_PRXQ_SHIFT 16
#define EQOS_MTL_RXQ0_DEBUG_PRXQ_MASK 0x7fff
#define EQOS_MTL_RXQ0_DEBUG_RXQSTS_SHIFT 4
#define EQOS_MTL_RXQ0_DEBUG_RXQSTS_MASK 3

#define EQOS_DMA_REGS_BASE 0x1000
struct eqos_dma_regs
{
    uint32_t mode;                               /* 0x1000 */
    uint32_t sysbus_mode;                        /* 0x1004 */
    uint32_t unused_1008[(0x1100 - 0x1008) / 4]; /* 0x1008 */
    uint32_t ch0_control;                        /* 0x1100 */
    uint32_t ch0_tx_control;                     /* 0x1104 */
    uint32_t ch0_rx_control;                     /* 0x1108 */
    uint32_t unused_110c;                        /* 0x110c */
    uint32_t ch0_txdesc_list_haddress;           /* 0x1110 */
    uint32_t ch0_txdesc_list_address;            /* 0x1114 */
    uint32_t ch0_rxdesc_list_haddress;           /* 0x1118 */
    uint32_t ch0_rxdesc_list_address;            /* 0x111c */
    uint32_t ch0_txdesc_tail_pointer;            /* 0x1120 */
    uint32_t unused_1124;                        /* 0x1124 */
    uint32_t ch0_rxdesc_tail_pointer;            /* 0x1128 */
    uint32_t ch0_txdesc_ring_length;             /* 0x112c */
    uint32_t ch0_rxdesc_ring_length;             /* 0x1130 */
    uint32_t ch0_interrupt_enable;               /* 0x1134 */
    uint32_t ch0_rx_interrupt_wd_timer;          /* 0x1138 */
    uint32_t ch0_slot_func_ctrl_status;          /* 0x113c */
    uint32_t unused_1140[1];                     /* 0x1140 */
    uint32_t ch0_current_app_txdesc;             /* 0x1144 */
    uint32_t unused_1148[1];                     /* 0x1148 */
    uint32_t ch0_current_app_rxdesc;             /* 0x114c */
    uint32_t unused_1150[1];                     /* 0x1150 */
    uint32_t ch0_current_app_txbuffer;           /* 0x1154 */
    uint32_t unused_1158[1];                     /* 0x1158 */
    uint32_t ch0_current_app_rxbuffer;           /* 0x115c */
    uint32_t ch0_status;                         /* 0x1160 */
    uint32_t ch0_miss_frame_cnt;                 /* 0x1164 */
    uint32_t ch0_rx_eri_cnt;                     /* 0x1168 */
};

#define EQOS_DMA_MODE_SWR BIT(0)

#define EQOS_DMA_SYSBUS_MODE_RD_OSR_LMT_SHIFT 16
#define EQOS_DMA_SYSBUS_MODE_RD_OSR_LMT_MASK 0xf
#define EQOS_DMA_SYSBUS_MODE_EAME BIT(11)
#define EQOS_DMA_SYSBUS_MODE_BLEN16 BIT(3)
#define EQOS_DMA_SYSBUS_MODE_BLEN8 BIT(2)
#define EQOS_DMA_SYSBUS_MODE_BLEN4 BIT(1)

#define EQOS_DMA_CH0_CONTROL_PBLX8 BIT(16)

#define EQOS_DMA_CH0_TX_CONTROL_TXPBL_SHIFT 16
#define EQOS_DMA_CH0_TX_CONTROL_TXPBL_MASK 0x3f
#define EQOS_DMA_CH0_TX_CONTROL_OSP BIT(4)
#define EQOS_DMA_CH0_TX_CONTROL_ST BIT(0)

#define EQOS_DMA_CH0_RX_CONTROL_RXPBL_SHIFT 16
#define EQOS_DMA_CH0_RX_CONTROL_RXPBL_MASK 0x3f
#define EQOS_DMA_CH0_RX_CONTROL_RBSZ_SHIFT 1
#define EQOS_DMA_CH0_RX_CONTROL_RBSZ_MASK 0x3fff
#define EQOS_DMA_CH0_RX_CONTROL_SR BIT(0)

#define EQOS_SDMEMCOMPPADCTRL_PAD_E_INPUT_OR_E_PWRD BIT(31)

#define EQOS_AUTO_CAL_CONFIG_START BIT(31)
#define EQOS_AUTO_CAL_CONFIG_ENABLE BIT(29)

