
/* 

【测试目的】:
当输入参数文件描述符filedes无效时，测试read读操作是否成功，是否返回的错误号为EBADF。

【测试类型】:
接口测试

【先决条件】:
操作系统已运行。

【测试步骤】:
文件描述符filedes无效。打开目录路径。查看接口返回值。

【预期结果】:
返回值为-1，错误号为EBADF。

【评价准则】:
与预期的测试结果一致
 */


/**************************** 引用部分 *****************************************/
#include <stdio.h>
#include <utime.h>
#include <errno.h>
#include <fcntl.h>
#include "test.h"
/*************************** 前向声明部分 ****************************************/
/**************************** 定义部分 *****************************************/
/*************************** 前向声明部分 ****************************************/
/**************************** 定义部分 *****************************************/
/****************************** 实现部分 *********************************/
int	OS_FS_Read_EBADF1()
{
    int isOK = 0;
    int ret;
    char a[100] = "";

    /*test*/
    ret = read(-1, a, 4);
    if (ret != -1 || errno != EBADF)
    {
        TEST_ERRPRINT("read");
        isOK = 1;
    }

    if (isOK)
    {
        TEST_ERRPRINT("open");
        return PTS_FAIL;
    }
    else
    {
        TEST_OKPRINT();
        return PTS_PASS;
    }
}
